Revit 2024 API
AssemblyDifferenceMemberDifference Members
The AssemblyDifferenceMemberDifference type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from AssemblyDifference.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from AssemblyDifference.)
MemberDifference
 Difference between the assembly members
MemberId1
 Id of the member in the first assembly
MemberId2
 Id of the member in the second assembly
See Also
AssemblyDifferenceMemberDifference Class
Autodesk.Revit.DB Namespace